from flask import Flask, render_template

app = Flask(__name__)

movies = [
    {
        "id": 1,
        "title": "Интерстеллар",
        "year": 2014,
        "rating": 8.7,
        "genre": "фантастика, драма и приключения",
        "description": "в будущем Земля страдает от засухи, пыльных бурь и голода. Группа исследователей отправляется в космическое путешествие через червоточину (кротовую нору) возле Сатурна, чтобы найти новую планету для спасения человечества. В центре сюжета — личная драма главного героя, Купера: он оставляет семью, чтобы возглавить миссию. Ключевой элемент — эффекты теории относительности (замедление времени рядом с чёрной дырой Гаргантюа)."
    },
    {
        "id": 2,
        "title": "Матрица",
        "year": 1999,
        "rating": 8.5,
        "genre": "фантастика, киберпанк и боевик",
        "description": "Хакер Нео узнаёт, что реальность, которую он считал настоящей, — иллюзия. Разумные машины создали симуляцию (Матрицу), чтобы поработить людей: их сознание погружено в виртуальный мир, а тела используются как источник энергии. Нео с помощью повстанцев (Морфеус, Тринити) выбирает борьбу против машин."
    },
    {
        "id": 3,
        "title": "Шрек",
        "year": 2001,
        "rating": 8.1,
        "genre": "фэнтезийная комедия",
        "description": "зелёный огр Шрек живёт на болоте, но его покой нарушает лорд Фаркуад, который изгоняет туда сказочных существ. Чтобы вернуть себе болото, Шрек заключает сделку: он спасает принцессу Фиону из башни, охраняемой драконом, а Фаркуад в обмен очищает его болото. По пути к нему присоединяется болтливый Осёл. В ходе приключений выясняется тайна Фионы: из-за проклятия она каждую ночь превращается в зелёную великаншу"
    },
    {
        "id": 4,
        "title": "Властелин колец",
        "year": 2001,
        "rating": 8.6,
        "genre": "приключения, драма, боевик",
        "description": "Хоббит Фродо везёт Кольцо Всевластья в Мордор, чтобы уничтожить его в Роковой горе и спасти Средиземье от Саурона."
    },
    {
        "id": 5,
        "title": "Гарри Поттер",
        "year": 2001,
        "rating": 8.3,
        "genre": "фэнтези, приключения и семейный",
        "description": "Одиннадцатилетний Гарри Поттер узнаёт, что он волшебник, поступает в школу Хогвартс, заводит друзей (Рона Уизли и Гермиону Грейнджер) и противостоит тёмному магу Волан-де-Морту."
    }
]

@app.route("/")
def index():
    return render_template("index.html", movies=movies)


@app.route("/movie/<int:movie_id>")
def movie(movie_id):
    for movie in movies:
        if movie["id"] == movie_id:
            return render_template("movie.html", movie=movie)

    return "Фильм не найден", 404


if __name__ == "__main__":
    app.run(debug=True)
